In [1]:
import pandas as pd
import numpy as np

In [2]:
np.random.rand(5, 5)

array([[0.66040774, 0.47507964, 0.75594902, 0.30637566, 0.27675972],
       [0.35894218, 0.64057673, 0.36753172, 0.67241664, 0.33712606],
       [0.17762461, 0.30865646, 0.71770522, 0.64631248, 0.0832768 ],
       [0.91531431, 0.10501914, 0.81446973, 0.18899351, 0.37772329],
       [0.69751619, 0.86944401, 0.08823652, 0.44423795, 0.9591845 ]])

In [3]:
dados = np.random.rand(5, 5)

In [4]:
#criando um dataframe no pandas
#usar a classe pd.DataFrame()

pd.DataFrame(data = dados)

          0         1         2         3         4
0  0.842729  0.276492  0.122621  0.309940  0.722840
1  0.603371  0.397943  0.286333  0.261333  0.857127
2  0.279287  0.378679  0.817921  0.346736  0.677173
3  0.785529  0.947596  0.472319  0.897414  0.318885
4  0.271810  0.513199  0.301286  0.294555  0.889534

In [5]:
pd.DataFrame(data = dados, index="a b c d e".split())

          0         1         2         3         4
a  0.842729  0.276492  0.122621  0.309940  0.722840
b  0.603371  0.397943  0.286333  0.261333  0.857127
c  0.279287  0.378679  0.817921  0.346736  0.677173
d  0.785529  0.947596  0.472319  0.897414  0.318885
e  0.271810  0.513199  0.301286  0.294555  0.889534

In [6]:
pd.DataFrame(data = dados, index="a b c d e".split(), columns="X Y Z W H".split())

          X         Y         Z         W         H
a  0.842729  0.276492  0.122621  0.309940  0.722840
b  0.603371  0.397943  0.286333  0.261333  0.857127
c  0.279287  0.378679  0.817921  0.346736  0.677173
d  0.785529  0.947596  0.472319  0.897414  0.318885
e  0.271810  0.513199  0.301286  0.294555  0.889534

In [7]:
df = pd.DataFrame(data = dados, index="a b c d e".split(), columns="X Y Z W H".split())

In [8]:
df["X"]

a    0.842729
b    0.603371
c    0.279287
d    0.785529
e    0.271810
Name: X, dtype: float64

In [9]:
type(df["X"])

pandas.core.series.Series

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df[["X", "W"]]

          X         W
a  0.842729  0.309940
b  0.603371  0.261333
c  0.279287  0.346736
d  0.785529  0.897414
e  0.271810  0.294555

In [12]:
df.X

a    0.842729
b    0.603371
c    0.279287
d    0.785529
e    0.271810
Name: X, dtype: float64

In [14]:
df["new"] = [1, 2, 3, 4, 5]

In [16]:
df

          X         Y         Z         W         H  new
a  0.842729  0.276492  0.122621  0.309940  0.722840    1
b  0.603371  0.397943  0.286333  0.261333  0.857127    2
c  0.279287  0.378679  0.817921  0.346736  0.677173    3
d  0.785529  0.947596  0.472319  0.897414  0.318885    4
e  0.271810  0.513199  0.301286  0.294555  0.889534    5

In [17]:
df["new2"] = df["X"] * df["Y"]

In [18]:
df

          X         Y         Z         W         H  new      new2
a  0.842729  0.276492  0.122621  0.309940  0.722840    1  0.233008
b  0.603371  0.397943  0.286333  0.261333  0.857127    2  0.240107
c  0.279287  0.378679  0.817921  0.346736  0.677173    3  0.105760
d  0.785529  0.947596  0.472319  0.897414  0.318885    4  0.744365
e  0.271810  0.513199  0.301286  0.294555  0.889534    5  0.139492

In [19]:
df.loc["a"] #FUNÇÃO LOC VAI SELECIONAR NO DATAFRAME VALORES ESPECIFICOS

X       0.842729
Y       0.276492
Z       0.122621
W       0.309940
H       0.722840
new     1.000000
new2    0.233008
Name: a, dtype: float64

In [20]:
df.loc[["a", "b"]]

          X         Y         Z         W         H  new      new2
a  0.842729  0.276492  0.122621  0.309940  0.722840    1  0.233008
b  0.603371  0.397943  0.286333  0.261333  0.857127    2  0.240107

In [22]:
df.loc["a", "X"]

np.float64(0.842728919224666)

In [23]:
df.loc[["a", "b"], "X"]

a    0.842729
b    0.603371
Name: X, dtype: float64

In [24]:
df

          X         Y         Z         W         H  new      new2
a  0.842729  0.276492  0.122621  0.309940  0.722840    1  0.233008
b  0.603371  0.397943  0.286333  0.261333  0.857127    2  0.240107
c  0.279287  0.378679  0.817921  0.346736  0.677173    3  0.105760
d  0.785529  0.947596  0.472319  0.897414  0.318885    4  0.744365
e  0.271810  0.513199  0.301286  0.294555  0.889534    5  0.139492

In [25]:
df.iloc[0]

X       0.842729
Y       0.276492
Z       0.122621
W       0.309940
H       0.722840
new     1.000000
new2    0.233008
Name: a, dtype: float64

In [26]:
df.iloc[0:3]

          X         Y         Z         W         H  new      new2
a  0.842729  0.276492  0.122621  0.309940  0.722840    1  0.233008
b  0.603371  0.397943  0.286333  0.261333  0.857127    2  0.240107
c  0.279287  0.378679  0.817921  0.346736  0.677173    3  0.105760

In [27]:
df.iloc[0:3, 1]

a    0.276492
b    0.397943
c    0.378679
Name: Y, dtype: float64